{"start": 0.0, "end": 21.240000000000002, "text": "  So, hello everyone. Welcome to the PC seminar. Today we have with us Professor Amir Mohad  from American University of Beirut and he'll be talking on the Goethe and Parameterized  Complexity of Token Sliding and Token Jumping. Thank you for joining us Professor. Over to  you now. Thank you, Prasipatay. Thank you for having", "id": 0}
{"start": 21.240000000000002, "end": 44.28, "text": "  me. It's a real pleasure to be here. So, all right, let's jump right into it.  So, since I did not really know the audience too well, I made the assumption that many  of you maybe have not seen this area of combinatorial reconfiguration problems. So, I decided what", "id": 1}
{"start": 44.28, "end": 67.48, "text": "  I'm going to do is I'm going to give a gentle introduction to the area just to show you how  many exciting problems and open problems are there. And then I will talk more about token  jumping and token sliding specifically, what we know about them, what we knew about  them before we started working on this project, what we managed to discover and the tons of", "id": 2}
{"start": 67.48, "end": 87.6, "text": "  questions that remain to be answered. Right? And it's a really, I mean, the questions are  so nice to state, so easy to state and they are accessible really to researchers at any  level, which is one of the reasons why I enjoy working on these problems. So, hopefully,", "id": 3}
{"start": 87.6, "end": 107.64, "text": "  you'll get to enjoy them too. So, before I start, I should point out that this is joint  work that started back in the combinatorial reconfiguration workshop almost two years  ago. And it's joint work with Valentin Barche, Nicolas Busquet, Clement Dallard and Karl Lohmer,", "id": 4}
{"start": 107.64, "end": 131.12, "text": "  who is my master's student. All right. So, the outline of the talk, it's going to be  in four sections. I will give a gentle introduction to combinatorial reconfiguration because I  know many of you might not have seen such problems. Then I will talk about token jumping", "id": 5}
{"start": 131.12, "end": 153.44, "text": "  and token sliding, what we know about them in terms of classical complexity or one-dimensional  complexity. Then I'll talk about the parametreous complexity of these two problems and what  we know as of today, as we speak, and what are the problems that remain to be solved.  And then the last part of the lecture is where I will put some of the technical stuff to show", "id": 6}
{"start": 153.44, "end": 177.24, "text": "  you, to give you an idea about how we prove things when we deal with such problems and  where are the difficulties and what kind of techniques have been developed. So, I try  to keep the technical part as light as I could so that really, I mean, I can focus on the  big picture and the questions to be asked and answered. So, if you have any questions", "id": 7}
{"start": 177.24, "end": 201.56, "text": "  along the way, please feel free to interrupt me either in the chat or by unmuting yourselves.  So, don't worry about leaving the questions till the end. You can interrupt me whenever  you feel, whenever I say something that doesn't make sense. Hopefully, that won't happen  too often. All right, so what is combinatorial reconfiguration? So, the best way, I think,", "id": 8}
{"start": 201.56, "end": 226.36, "text": "  to introduce is with a familiar example, which is one player games and the most common one  that we use is the 15 puzzle game. So, for those of you who don't know the 15 puzzle  game, so you're given like a four by four grid and you have one empty square and basically,  you have all the remaining 15 squares are numbered from 1 to 15 and they come in some", "id": 9}
{"start": 226.36, "end": 253.16000000000003, "text": "  ordering and your job is to basically move the squares around so that all the numbers become  ordered. So, it's a byro, so they have to be ordered this way. So, if you notice in this  figure, the only problem is that 14 and 15 are reversed, but the only moves that you're allowed  to do is to basically move a number into the empty square and basically, you have to do a", "id": 10}
{"start": 253.16000000000003, "end": 274.2, "text": "  sequence of moves so that you get all of the numbers in order. And for those of you who know  this game, this example that I have on the slide is actually unsolvable. There is no way you can  flip the order of 14 and 15 in this puzzle. And I have a link here if you want to actually play", "id": 11}
{"start": 274.2, "end": 296.12, "text": "  the puzzle online, which is pretty fun. So, why do I do I start my talk by talking about 15 puzzle?  It's because it's really, I mean, the way you solve the 15 puzzle tells you a lot about the area  of combinatorial reconfiguration. So, the standard way we would think about the 15 puzzle is by looking", "id": 12}
{"start": 296.12, "end": 316.12, "text": "  at the state space or what we call the reconfiguration graph of the 15 puzzle. So, what does that  graph consist of? Well, we have one vertex or one node in this graph for each possible configuration  of the puzzle. So, basically, each possible configuration, so it would be a possible permutation", "id": 13}
{"start": 316.12, "end": 341.40000000000003, "text": "  of the 15 numbers in addition to where you're going to put the empty square. Each one of those  will be a vertex in the graph. And now we connect two vertices in that graph whenever  one can be reached from the other by a single move. And what do we mean here by a single move  where it's basically just moving a number into the empty square? So, if you look at the top", "id": 14}
{"start": 341.40000000000003, "end": 366.04, "text": "  node here in this graph, there are four possibilities that you can do in one move,  which we call a reconfiguration step, which is you can move nine into the empty square,  you can move three into the empty square, 12 or 15. And that gives us basically four neighbors  of that vertex in the graph. Okay, and we call this whole graph the reconfiguration graph or the", "id": 15}
{"start": 366.04, "end": 391.24, "text": "  state space if you're more comfortable thinking about states, the states of the game. So, now,  given this graph, the reconfiguration graph, there are tons of very interesting questions that you  can ask about it. There are structural questions and there are algorithmic questions. And these are  typically the types of questions that we're interested in in this area of combinatorially", "id": 16}
{"start": 391.24, "end": 410.2, "text": "  configuration. So, a couple of examples of structural questions would be, well, the simplest one would  be how big is this reconfiguration graph, right? How many vertices or how many edges?  And that's usually not a very hard question to answer in terms of upper and lower bounds.", "id": 17}
{"start": 411.32, "end": 435.16, "text": "  More interestingly, you could ask, is this reconfiguration graph connected, right? Or  is, can I reach any state starting from any other state by a sequence of legal moves? And as I  told you before, for the 15 puzzle, the reconfiguration graph is definitely not connected,  because there was no way to reverse 14 and 15 in the previous example that I showed you,", "id": 18}
{"start": 435.16, "end": 459.56, "text": "  and you can easily prove that, by the way. So, when it's not connected, another question would be,  how many components does it have? Is there some sort of nice structure to the components of this  graph? And then another question would be, what is the diameter of this reconfiguration graph or  of each one of its components? And that's usually a very important question to ask when you're dealing", "id": 19}
{"start": 459.56, "end": 485.8, "text": "  with one-player games, because this could tell you what would be the worst possible shortest path  to reach a target configuration or to solve your game, to win your game, for example. And in the  literature, this is sometimes known as God's number, which would be the diameter of the  reconfiguration graph. And these are all very interesting structural questions to ask about", "id": 20}
{"start": 485.8, "end": 508.68, "text": "  this reconfiguration graph. Now, on the algorithmic side or the computational side,  there's the obvious question of, if I'm given a starting state and some ending state or target  state, like in the case of the puzzle game, that I'm given some starting state and we know what  the goal state is. So, here one decision problem would be to answer the question whether it's", "id": 21}
{"start": 508.68, "end": 526.04, "text": "  possible to get to the target state starting from some initial state that is also given to me.  So, you could decide to solve this problem either as a decision problem or as a search problem,  which would give you the actual sequence of steps that will take you from a state to the target state.", "id": 22}
{"start": 529.8, "end": 553.72, "text": "  Other interesting computational problems, is it always possible to go from one configuration  to any other? And this is basically also related to the structural question about connected components.  And the last question that I will mention, which is also interesting, is how fast can you go from  one configuration to another? Meaning, can you do it in at most case steps?", "id": 23}
{"start": 556.52, "end": 580.12, "text": "  There is a question I should wait or no?  Okay. All right. So, think about all of these questions that we paused using the simple 15 puzzle  game. And now we're going to look at a lot of other possible problems where the same", "id": 24}
{"start": 580.12, "end": 604.92, "text": "  any configuration graph can be extracted. And we can ask the same set of questions.  So, all of you here are familiar with the KSAT problem. So, you're given a Boolean formula and  you want to know if you can satisfy this formula by assigning values to the variables. And we know  that this is NP-complete for K greater than or equal to three. So, now how can you transform this", "id": 25}
{"start": 604.92, "end": 632.36, "text": "  into a reconfiguration problem? Well, it's very simple. So, now you're given a formula  and you're given two satisfying assignments. So, you can think of those satisfying assignments as  bit vectors. And so, now the question that you can ask is, can I go from the first satisfying  assignment to the next one by basically flipping one bit at a time under the condition that I", "id": 26}
{"start": 632.36, "end": 654.2, "text": "  remain a satisfying assignment at all times? And notice that without this condition, the problem  is trivial. So, you can basically just flip the bits however you like and reach S from T or T from S.  But once you add this constraint of you should remain a satisfying assignment, the problem becomes", "id": 27}
{"start": 654.2, "end": 674.52, "text": "  way more interesting. And you can think of this problem again as walking in the solution space  of the given formula of all the satisfying assignment of the formula F.  All right, so that's the SAT reconfiguration problem. Let's look at another example.", "id": 28}
{"start": 675.8, "end": 701.24, "text": "  Graph coloring. We all know it, we all love it. You're given a graph and some integer K and you are  asked whether you can properly K color the graph G. And we know again that this is NP-complete for  K greater than or equal to three. How do you transform that into a reconfiguration problem?  Well, now you're given a graph, you're given two colorings of the graph, alpha and beta. And the", "id": 29}
{"start": 701.24, "end": 722.2800000000001, "text": "  question is, can you recolor alpha to get the, to beta? But you need to recolor one vertex at a time  and you need to remain a proper K coloring throughout. Same idea again leads us to this  notion of the reconfiguration space where we are looking at the K colorings of the graph and how", "id": 30}
{"start": 722.28, "end": 742.8399999999999, "text": "  they are connected under this adjacent simulation that we define, which is a single vertex recoloring.  The final example that I will mention, which will be basically what we will focus on in the  rest of the talk is a token placement, I call it, but as you will all guess, this is the famous", "id": 31}
{"start": 742.8399999999999, "end": 766.52, "text": "  independent set problem. But we will look at it as a token placement problem because it will be  more useful for the rest of the talk. So you're given a graph G and an integer K. And the question  is, can you place K tokens on your graph, K black tokens, so that no two of these tokens share an  edge? And of course, we all know that this is an NP-complete problem. So how can you transform", "id": 32}
{"start": 766.52, "end": 786.84, "text": "  this problem into a reconfiguration problem? Again, now I'm given a graph, two independent sets of the  graph, each of size K. And the question is, can I go from one independent set to the other  under what rule? So here defining the rule for independent set, how can I go between", "id": 33}
{"start": 786.84, "end": 807.4, "text": "  consecutive independent sets becomes a little bit less obvious. And there are two main strategies  that people have attempted. So the first rule is what we call token jumping. So you are basically  allowed to take any token on your graph and jump it to any other vertex on the graph, assuming that", "id": 34}
{"start": 807.4, "end": 831.7199999999999, "text": "  it doesn't have a token and that you maintain an independent set at all times. So for example, in this  example that I have here, it would be perfectly okay to take this token here and jump it to this  vertex here. Or I could also take this token here and jump it to this vertex here. So that no,", "id": 35}
{"start": 831.7199999999999, "end": 860.12, "text": "  actually that would violate the independence. So you can jump to any other vertex as long as you  maintain independence. And we call that the token jumping rule. The other rule is basically token  sliding. So in this case, we only allow a token to slide along edges of the graph.  So a token can only move to an adjacent vertex, assuming of course this does not violate independence.", "id": 36}
{"start": 860.92, "end": 883.72, "text": "  So now we have two different reconfiguration graphs we can think about. We can think about the  reconfiguration graph under the token jumping adjacency. And we can think about the reconfiguration  graph under the token sliding adjacency. And we're going to talk about these two different  problems because they do actually behave quite differently and they produce quite interesting", "id": 37}
{"start": 883.72, "end": 911.3199999999999, "text": "  results. Like the difference between the two, we don't fully understand yet, but we kind of know  that token sliding can be harder than token jumping. But there's still a lot of questions to be answered.  All right. So some of you might be asking, why do we care about studying such problems? There's a lot  of motivations out there. I mean, as sometimes I would say you don't need motivation. They're", "id": 38}
{"start": 911.3199999999999, "end": 933.0, "text": "  interesting. There's a lot of open questions that we need to answer. But you can also think about  reconfiguration problems as another way of modeling real world algorithmic problems. Because you  usually never start from scratch. When you're trying to solve real world problems, you usually  start from something and you're trying to prove it or make it better or change it to something", "id": 39}
{"start": 933.0, "end": 957.08, "text": "  more appropriate. Another very good application of studying these problems is that they give you a  better understanding of solution spaces, which can be very important for other areas as well.  And they have been used in statistical physics, quantum computing, and in the field of  physics, quantum computing, and in complexity theory, combinatorics, and robotics, and hopefully", "id": 40}
{"start": 957.08, "end": 984.76, "text": "  many more applications to come. But what I would tell you is that there are so many very interesting  problems that are so easy to start thinking about without having too much background, which is why  I think this is a very nice area to start working on at any level in your research career.  All right, so I'll take a break here and take questions if there are any. And then we will dive", "id": 41}
{"start": 984.76, "end": 1010.68, "text": "  into the token jumping and token sliding problems, what we know about them,  in terms of classical complexity, and what was basically the starting point for the project  that led us to this paper. Any questions at this point?  I apologize for the small context which I am interrupting here. So this is just to announce", "id": 42}
{"start": 1010.68, "end": 1030.36, "text": "  for the PC 301 workshop that will be happening in December end. And this will be slightly different  from the previous two workshops. First major difference, this will be online. Second is  some advanced topics will be discussed. So anyone who intends to explore somewhat more complex", "id": 43}
{"start": 1030.76, "end": 1053.9599999999998, "text": "  topics in parameterized algorithms is invited to have a check. They can look at the website that  has been shared on the chat. And if you wish, you can register simply by filling a form that is  linked at the bottom of the webpage. So just to inform you all about it and sorry for the  interruption professor. Now you can come to us. All right.", "id": 44}
{"start": 1054.68, "end": 1076.3600000000001, "text": "  All right. So let's start talking about token jumping, token sliding, and a little bit about  classical complexity. I know everybody here knows about P and NP. So I'm not going to talk about  this. Some of you might not be familiar with the PSPACE class. So just a quick note that's as much", "id": 45}
{"start": 1076.3600000000001, "end": 1102.44, "text": "  as you will need to know for this talk is that PSPACE is the set of all decision problems  that can be solved using a polynomial amount of space. And the reason why I mentioned this class  is because many, many, many, many reconfiguration problems actually are PSPACE complete.  Okay. And so what we know, the standard inclusion is we know that P is contained in NP,", "id": 46}
{"start": 1102.44, "end": 1124.6799999999998, "text": "  which is contained in PSPACE. But a very useful thing about PSPACE is that Savage  proved that it's equal to NP SPACE. So polynomial space and non-deterministic  polynomial space are the same class, basically. And that's extremely useful when you start to think  about reconfiguration problems. Because if you think about a reconfiguration problem where you're", "id": 47}
{"start": 1124.6799999999998, "end": 1146.3600000000001, "text": "  given some state and you want to reach the other one. So basically you can solve that easily in  non-deterministic polynomial space, which basically implies that they are in PSPACE.  But actually you can show a lot more than that. You can show that many, really many reconfiguration", "id": 48}
{"start": 1146.3600000000001, "end": 1166.52, "text": "  problems are actually PSPACE complete, which is not surprising. The fact that many of these  reconfiguration problems are PSPACE complete is not very surprising. And them not being in NP  is because they don't always have polynomial size certificates, which also makes sense. Because", "id": 49}
{"start": 1166.52, "end": 1189.56, "text": "  sometimes the number of steps that you need to take to go from one configuration to the other  might very well be exponential in the graph size. But there are also some extremely surprising  results. And these are some of the results, some of my favorite results in the area.  So for example, you all know that coloring is NP complete even for K equals three.", "id": 50}
{"start": 1190.36, "end": 1210.9199999999998, "text": "  However, it turns out that if you try to solve the recoloring problem for K equals three,  it's actually polynomial time solvable. So if I give you two, three colorings of a graph and I ask you,  is there a path between them that recolors one vertex at a time and is always a valid three", "id": 51}
{"start": 1210.9199999999998, "end": 1234.84, "text": "  coloring, then this problem can be solved in polynomial time. And the recoloring problem  only becomes PSPACE complete for K equal four and more.  Right. So that's the first surprising result. Another very surprising result is that  as your old FPT experts here, I know that you're all familiar with the fact that usually", "id": 52}
{"start": 1234.84, "end": 1258.04, "text": "  when we study problems on graphs of bounded bucket width, path width, tree width,  they tend to become easier. It turns out that that's not really the case for reconfiguration  problems, at least for token sliding and jumping, which is the two problems that are related to  independent set. It turns out that those two problems remain PSPACE complete even if you", "id": 53}
{"start": 1258.04, "end": 1279.16, "text": "  have a graph of constant tree width or path width or even bucket width. So a very, very,  very simple graph structure. Still the problem remains hard.  All right. And finally, the last theorem that I also like a lot shows you basically that sliding", "id": 54}
{"start": 1279.16, "end": 1306.44, "text": "  and jumping behave differently. And it was shown that if you restrict yourself to bipartite graphs,  where we know that max independent set can be solved in polynomial time,  if you restrict yourself to those graphs, it turns out that token jumping  is NP complete, whereas token sliding is PSPACE complete, which is a strange", "id": 55}
{"start": 1308.44, "end": 1335.72, "text": "  difference between the behavior of those two problems.  All right. So in fact, we know a lot more about token sliding and token jumping. These  problems have been at the heart of the area of combinatorial reconfiguration. They have been  studied so much. And we know so much about them, at least in terms of standard or classical complexity.", "id": 56}
{"start": 1335.72, "end": 1355.16, "text": "  So some of the important results for our paper that we're going to focus on  is this result. So that's going to be the starting point of the results that we will discuss next  when we move to parametrize complexity. So the fact that token sliding and token jumping,", "id": 57}
{"start": 1356.68, "end": 1377.88, "text": "  our PSPACE complete and then NP complete respectively on bipartite graphs was the starting  point of our next paper. But there are some very interesting results here that are also  worth mentioning. So for example, for even whole field graphs, we know how to solve token jumping  in polynomial time. But the complexity of independent set even remains open on this class", "id": 58}
{"start": 1377.88, "end": 1398.92, "text": "  of graphs. And the complexity of token sliding also remains open. So we don't know how to check if  given two independent sets, I can slide one to the other. Can you answer that question in  polynomial time for even whole free graphs? For split graphs and chordal graphs, they also behave", "id": 59}
{"start": 1398.92, "end": 1432.1200000000001, "text": "  extremely differently, token sliding and token jumping. So token sliding is PSPACE complete  on split graphs and chordal graphs while token jumping is polynomial time. And that is some  of the reasons why we feel that token sliding is harder usually than token jumping. But it's not  always the case. All right. So that's it for classical complexity. So now let's move on to", "id": 60}
{"start": 1432.1200000000001, "end": 1456.6, "text": "  parametrize complexity. And let's basically think about how you can parametrize those two  problems, token jumping and token sliding. So there's the obvious parameter would be the number  of tokens. Right. So one of the obvious parameters would be the number of tokens. So and we're going  to denote that by K. Another parameter would be the length of the sequence, like how many steps", "id": 61}
{"start": 1456.6, "end": 1483.5600000000002, "text": "  does it take to go from one independent set to the other? You can also obviously parametrize  by tree width or path width or any combination of the above. When we started working on this problem,  our initial aim was to basically study the parametrized complexity of token sliding and token  jumping on bipartite graphs using the parameter K number of tokens. Right. Because remember,", "id": 62}
{"start": 1483.5600000000002, "end": 1504.76, "text": "  we saw that token sliding is PSPACE complete on bipartite graphs and token jumping is NP-com.  So you were interested to see if basically this is going to give us W1 hardness for token sliding  and FPTNES for token jumping. Or at least that was the initial hope. That's why we started working", "id": 63}
{"start": 1504.76, "end": 1528.2, "text": "  on this project. We weren't able to answer the two questions. So we were able to answer one side  of the question, which is we were able to show that on bipartite graphs, token sliding is in fact  W1 hard. So token sliding parametrized by the number of tokens on bipartite graphs is W1 hard.", "id": 64}
{"start": 1528.76, "end": 1549.32, "text": "  We were not able to answer the question for token jumping. So that is still an open question.  So we haven't answered that question and failed on the next question. We started thinking about  ways to basically simplify a little bit some of these questions. So the next thing we asked", "id": 65}
{"start": 1549.32, "end": 1571.24, "text": "  ourselves, so there are two directions where you can try and simplify. So the next thing we asked  ourselves was, okay, so from bipartite graphs, how can I go to other classes of graphs  and see where token jumping becomes hard or easy? And it turned out that if you basically exclude", "id": 66}
{"start": 1571.24, "end": 1594.04, "text": "  only C4 from your graph, right? And so because in bipartite graphs, you're excluding all odd cycles.  Right? So we started thinking about what kinds of cycles affect the behavior of those problems.  So the first question was, what about C4 free graphs? And it turned out that both problems", "id": 67}
{"start": 1594.04, "end": 1620.6, "text": "  remain W1 hard on C4 free graphs. Now, if you exclude C3 and C4, it turns out that token jumping  becomes FPD, has an order K squared kernel. But for token sliding, we were not able to determine the  complexity. Now, if you go to the other side of that, so what if we enforce both bipartite", "id": 68}
{"start": 1621.1599999999999, "end": 1646.76, "text": "  as well as C4 freeness? So in that case, we were able to show that both problems became FPD.  Okay, and basically the bipartite bounded degree graphs was just a stepping stone  to get to the bipartite C4 free graph result. So let me repeat that maybe slightly more clearly.", "id": 69}
{"start": 1646.84, "end": 1673.32, "text": "  So after basically answering the first question, which was bipartite graphs, we were able to show  that token sliding was W1 hard, but we were not able to determine the complexity of token jumping.  So then we went to C4 free graphs, and we were able to show that both problems are actually W1 hard.  Then if we added one more constraint, which was C3 C4 free graphs, we got FPDness for token jumping,", "id": 70}
{"start": 1673.32, "end": 1696.28, "text": "  but it remained open for token sliding. And on the other side of the spectrum, so if we keep  bipartite and enforce the C4 freeness, we get FPD for both problems.  And as a side note, this blue result is not part of our paper. This was known prior to our paper.", "id": 71}
{"start": 1696.84, "end": 1704.84, "text": "  So any questions about the results?", "id": 72}
{"start": 1719.24, "end": 1750.6, "text": "  No questions. All right, cool.  So lots of open problems. The first and obvious one is what is the pattern? Is token jumping FPD  paramptres by K on bipartite graphs? And that's really, I mean, that was the initial question that  we set out to answer and couldn't. So that remains open. And so I will not be going over the", "id": 73}
{"start": 1750.6, "end": 1774.76, "text": "  hardness reduction for token sliding on bipartite graphs because it's quite technical. I don't feel  a talk is the right place to go over it. But if you go over the reduction, you will see that  that it's the two problems really behave differently. And there doesn't seem to be a  chance to basically make the same type of reduction work for token jumping.", "id": 74}
{"start": 1775.72, "end": 1796.12, "text": "  So the second interesting open question is how about token jumping parametrized by K on triangle  free graphs? That's basically even more general than question one. Right? So and the reason why I  mentioned this question separately is because almost every reduction that I know of includes", "id": 75}
{"start": 1796.12, "end": 1816.44, "text": "  large cliques. So you need to use large cliques in your reductions. So how about if we don't allow  triangles and large cliques? So can we then say something about the problem?  So that's for token jumping. Now when you go to token sliding, so the open problem is", "id": 76}
{"start": 1817.3200000000002, "end": 1840.04, "text": "  what happens for token sliding on graphs of girth at least five? So if they are C3, C4 free. Or you  can even make that a bit weaker and ask for any girth of at least P for some constant P.  And for all of these questions, of course, polynomial kernels would be interesting as well,", "id": 77}
{"start": 1840.04, "end": 1861.6399999999999, "text": "  because in our case, we do get polynomial kernels for the FPT.  The polynomials are not great, but polynomial regardless.  All right. So in the rest of the talk, I will try to cover some of the technical stuff. And as", "id": 78}
{"start": 1861.6399999999999, "end": 1885.48, "text": "  promised, I will try to keep it as light as possible so that I can give you some of a lot of  the intuition and techniques that are used in this paper and that are generally used when  dealing with reconfiguration problems. So the first result that we will go over is this W  hardness on C4 free graphs, right? For both token sliding and token jumping. It's the same reduction", "id": 79}
{"start": 1885.48, "end": 1906.52, "text": "  and you will get both results because we will be using maximum independent sets. So if you're trying  to basically do token sliding from one maximum independent set to the other or token jumping,  these two rules become equivalent. Jumping becomes equivalent to sliding.", "id": 80}
{"start": 1907.16, "end": 1932.04, "text": "  Jumping becomes equivalent to sliding. So when you're dealing with maximum independent sets,  these two basically rules are the same. And that's what we're going to do. But what we're  going to prove actually is a stronger theorem. What we're going to prove is the following theorem.  If you take any P greater than or equal to four, then both problems are W hard on C4, C5,", "id": 81}
{"start": 1932.68, "end": 1961.8, "text": "  dot, dot, dot, up to Cp free graphs, which implies of course C4 free graphs.  But you can basically exclude any cycles from C4 up to Cp for constant P and the problems will  remain W1 hard. So how do we prove this result? In fact, we use a known reduction from", "id": 82}
{"start": 1962.04, "end": 1985.3999999999999, "text": "  a problem known as grid tiling, which is a W1 hard problem. And grid tiling is reduced  to the independent set problem on C4 up to Cp free graphs. And that reduction was used to show  that independent set remains W1 hard if you exclude C4 up to Cp for any constant P.", "id": 83}
{"start": 1985.4, "end": 2006.6000000000001, "text": "  But what is interesting and useful in that reduction is the graph that is obtained from  the reduction. So the graph that is obtained from the reduction has three properties that are going  to be useful to us. The first property is that you can partition the graph into basically 8k", "id": 84}
{"start": 2006.6000000000001, "end": 2028.6000000000001, "text": "  squared into P plus one cliques. So you have a bunch of cliques, each of size n, and all of the  edges basically are between the cliques. But that's it. That's it. That's the whole of the graph.  It's a bunch of cliques and edges between them. Of course, the more important property as well", "id": 85}
{"start": 2028.6000000000001, "end": 2054.68, "text": "  here is that this graph is going to be C4 up to Cp free. It will not have any of those cycles  as an induced subgraph. And it's an equivalent instance to the grid tiling instance. And that  basically gives you W1 hardness of independent set on this class of graphs. So notice in this case", "id": 86}
{"start": 2054.68, "end": 2078.44, "text": "  that an independent set of size 8k squared into P plus one will have to be a maximum independent  set because that's how many cliques we get in the resulting graph. And that's basically the sizes  that we will be working with more or less up to some modifications. But this will allow us to  basically conclude that both sliding and jumping are hard on this class of graphs.", "id": 87}
{"start": 2081.4, "end": 2102.12, "text": "  So how do we use this for showing hardness of token sliding and token jumping? And let's focus  on token sliding for now because it's going to be the same anyway. So we have those cliques  and some edges that go between the cliques. So the first attempt would be as follows. We will add", "id": 88}
{"start": 2102.7599999999998, "end": 2129.16, "text": "  a universal vertex to each one of the cliques and we will call this the starting set or the  starting independent set. And then we add another universal vertex to each one of the cliques and  call this the target independent set. And now basically we have our instance of token sliding.  We want to slide everybody in S down to T. So notice that this is useful because we don't", "id": 89}
{"start": 2129.16, "end": 2149.8, "text": "  introduce any of the forbidden cycles. So we are still fine. And if we could guarantee that all  of the tokens will be on the on the cliques simultaneously, then this will imply an independent  set in the original graph, which concludes our proof. But unfortunately in this case,", "id": 90}
{"start": 2149.8, "end": 2171.16, "text": "  we definitely cannot conclude that because each red token can slide independently here and then  here and then the next one can follow, etc, etc, etc. So you need some way of forbidden,  of forbidding these tokens to behave freely. We want to make sure that they will all be", "id": 91}
{"start": 2171.16, "end": 2194.2799999999997, "text": "  inside the cliques simultaneously and we will be done. And notice that we're going to have 8k  squared and 2p plus 1 tokens, right? One for each clique and two universal vertices for each clique.  So how do we fix this simultaneity issue? Well, here's how we can do it. So instead of simply", "id": 92}
{"start": 2194.2799999999997, "end": 2215.08, "text": "  adding universal vertices, we're also going to add an edge between every two universal vertices of a  clique and then we're going to add something that we call a switch. And in this case, it's a simple  edge and the red token here needs to go to the blue position, right? So now we have one extra", "id": 93}
{"start": 2215.7999999999997, "end": 2238.92, "text": "  token inside our graph. But now notice what happens. If any red token wants to come to the blue  position, then this red token needs to be moved to this position before. And if you move that token  up to the blue position, then you can no longer have any of the red tokens on the universal vertices,", "id": 94}
{"start": 2239.48, "end": 2260.36, "text": "  which means that they will all have to be simultaneously inside the cliques.  And now we get the behavior that we want. So now we can guarantee that if there is a sequence that  takes the red tokens to the blue position, then some way along that sequence, the tokens are all", "id": 95}
{"start": 2260.36, "end": 2280.84, "text": "  going to be within the cliques. Unfortunately, what happened here is we might have introduced some of  the forbidden cycles. We can no longer guarantee that this is C4 up to CP3. So what you can do in  this case to solve this problem, and I'm not going to go into the details, but the intuition should", "id": 96}
{"start": 2280.84, "end": 2302.28, "text": "  be pretty clear is that you can subdivide those edges, make them long enough so that you don't  introduce any forbidden cycles, and add appropriate tokens inside of them to get the same behavior.  Because notice that the number of such edges is bounded by a function of K, by a function of,", "id": 97}
{"start": 2302.28, "end": 2322.84, "text": "  yes, K and P. So you can make these edges, subdivide them as many times as  needed, add as many tokens as needed to maintain all the properties that we need, and to maintain  that we're going from one maximum independent set to the other, which will give you W1 hardness", "id": 98}
{"start": 2322.84, "end": 2350.76, "text": "  for both token sliding as well as token jumping. All right. Questions?  No questions. All right. So let's keep going.", "id": 99}
{"start": 2353.7200000000003, "end": 2378.12, "text": "  So now I'm going to talk about some positive, a positive result. So the result that I'm going  to talk about is this one here. Right? So I'm going to show you that on C3, C4 free graphs,  token jumping is actually FPT and has a quadratic kernel. But again, what we will show is a stronger", "id": 100}
{"start": 2378.12, "end": 2402.84, "text": "  result. So what we will show is the following theorem. What we will show  is, can be summarized as follows. So if you look at any graph,  or at any instance of the token jumping problem, so remember an instance of token jumping has the  input graph, the starting set, the target set, and K as the number of tokens.", "id": 101}
{"start": 2404.52, "end": 2430.2799999999997, "text": "  So let me try and draw something here. So if you look at your graph, you can kind of decompose it  into something which is more or less as follows. So you have S, you have T, the intersection need  not be empty. And then you have the neighborhood of S, you need T. And then you have the rest of the", "id": 102}
{"start": 2430.2799999999997, "end": 2457.56, "text": "  graph. So we're going to call the rest of the graph H. And we're going to call the closed neighborhood  of S, you need T, or if you will, this yellow part here, we call that J. Right? So we can think of  our problem of our graph as being decomposed into those two areas, H and J. Okay, so the theorem", "id": 103}
{"start": 2457.56, "end": 2481.32, "text": "  states the following. If H is epsilon sparse, where epsilon sparse means that the number of  edges is at most N squared minus epsilon, positive epsilon. So if H is epsilon sparse,  and J is C3, C4 free, then the problem admits a kernel, which is that big,", "id": 104}
{"start": 2481.32, "end": 2501.4, "text": "  k squared plus k into one plus one over epsilon. So notice now that we only need that H is epsilon  sparse. And we only require C3, C4, freeness inside J, which is S union T closed neighborhood,  closed neighborhood of S union T.", "id": 105}
{"start": 2505.16, "end": 2531.7200000000003, "text": "  And this idea is actually, is not a new idea. So this idea is, okay, I had the drawing here,  I should have used it. So the idea comes from, has been used before. And it's what we call the  buffer technique for the token jumping problem. And then the intuition behind the buffer technique  is very simple. So if I have S union T, but somewhere in the graph, which is not in the", "id": 106}
{"start": 2531.7200000000003, "end": 2557.4, "text": "  closed neighborhood of S union T, I have a case sized independent set, then you are done.  Right, if I have a case sized independent set in H,  then you're done. You can basically take all the tokens on S, jump them into those independent  yellow vertices in H, and then jump them back to T. So in some sense, when H has a large independent", "id": 107}
{"start": 2557.4, "end": 2577.48, "text": "  set, that's the easy case. Right, you're done. If you can find a large enough independent set in H,  you're done. And that's what we call the buffer technique, because it's been also used to show  that the problem is FPT on planar graphs, for example, or K3J free graphs, so graphs without", "id": 108}
{"start": 2577.48, "end": 2603.4, "text": "  large bikings. So it's a well known technique. All right.  So what do we show? So we're going to use the buffer technique, and we're going to combine it with  something else. So we show that you have a yes instance whenever one of those two conditions", "id": 109}
{"start": 2603.4, "end": 2625.56, "text": "  is true. The first condition is that H is epsilon sparse and contains more than this many vertices.  And this is relatively easy. When you contain this many vertices and you add epsilon sparse,  then you will have a case sized independent set. And that's basically the buffer technique.", "id": 110}
{"start": 2626.44, "end": 2646.68, "text": "  When H is epsilon sparse and has that many vertices or more, then H is guaranteed to have an  independent set of size K and you're done. So now you are stuck with what happens inside J,  or the closed neighborhood of S union T. And it turns out there, if you have C3C4 freeness,", "id": 111}
{"start": 2646.68, "end": 2672.7599999999998, "text": "  the only thing you need on top of that to guarantee a yes instance is a vertex of degree at least 3K.  So if you have C3C4 freeness inside J and the vertex of degree 3K, then again, you get a yes  instance. So let me prove those two statements separately, because they will be basically", "id": 112}
{"start": 2673.7999999999997, "end": 2695.56, "text": "  what we need for the final theorem, for the final theorem. So the first lemma, as I told you,  if H is epsilon sparse and has more than this many vertices, then it's a yes instance, because you  have a case sized independent set in H. The idea of this proof is simple. It's a counting argument.", "id": 113}
{"start": 2696.2, "end": 2720.2, "text": "  And what you need to do basically first is to show that H must contain a vertex of degree  less than an over K. And then basically you apply the standard greedy packing algorithm for  constructing an independent set of size K. And the reason you show that, the way you show that H  has a vertex of degree less than N over K is, again, standard counting argument and the hand", "id": 114}
{"start": 2720.2, "end": 2742.7599999999998, "text": "  shaking lemma. So if the minimum degree in H was at least N over K, then the number of edges would  be at least N squared over 2K, which will only happen in an epsilon sparse graph when N is less  than or equal to K to the power 1 over epsilon. And the rest of the proof is basically an induction", "id": 115}
{"start": 2742.7599999999998, "end": 2766.12, "text": "  on K. And so that shows you that when you do have an epsilon sparse graph with more than  this many vertices, then we have a yes instance. All right, so how about the second part of the  claim? So now what happens if we have a C3 C4 free J that has a vertex of degree 3K?", "id": 116}
{"start": 2767.0, "end": 2787.08, "text": "  Well, let's see what happens. So if we have a vertex of degree 3K, and I'm going to  circle it here in yellow. So how can the neighborhood of that vertex look? Well, we know that J is C3 free.  So the blue edges cannot exist, which means that the neighborhood of the yellow vertex is an", "id": 117}
{"start": 2787.08, "end": 2813.72, "text": "  independent set inside J, not in the whole graph. Well, in fact, in the whole well, no,  because we're only talking about J as a sub graph. Right. So the blue edges cannot exist,  because otherwise we will get a C3 inside J. All right. So now let's look at the other vertices", "id": 118}
{"start": 2813.72, "end": 2839.48, "text": "  in S-Union T. The other, the second observation that you need is that any vertex other than the  yellow vertex can have at most one neighbor in common with the yellow vertex. Because if you do  have two neighbors in common, then you will get a C4. So now what happens if we have 3K vertices", "id": 119}
{"start": 2839.48, "end": 2861.72, "text": "  in the neighborhood of the yellow vertex? Well, at most 2K of them can be connected  to some vertex in S-Union T, and you will get at least K of them, some K of them here  that are only connected to the yellow vertex. And so now basically, instead of using a buffer", "id": 120}
{"start": 2861.72, "end": 2892.92, "text": "  inside H, we have just found a buffer inside J, and we can use the same strategy. We can  jump all the tokens here, starting of course by the yellow token, and then jump them to where they  need to go. So now combining those two, observing lemmas together, if you will, we get the following", "id": 121}
{"start": 2893.0, "end": 2914.36, "text": "  theorem. So if H is alpha sparse, and J is C3, C4 free, then the problem admits a kernel on this  many vertices. And it's basically a simple application of the previous two lemmas. If we have more than  this many vertices in H, it's a trivial yes instance. If J has a vertex of degree 3K or more,", "id": 122}
{"start": 2914.36, "end": 2933.32, "text": "  it's a trivial yes instance. And now you combine all of this together. We know that S-Union T is  of size at most 2K. We know that the neighborhood of S-Union T is of size at most 2K times 3K,  which is roughly 6K squared. And now we know that the rest of the graph has at most that many vertices.", "id": 123}
{"start": 2934.84, "end": 2952.3599999999997, "text": "  So basically, you sum up those numbers, and you get this bound.  All right. So how does this theorem imply the result that I promised you to start with?", "id": 124}
{"start": 2955.56, "end": 2977.4, "text": "  So that token jumping and token sliding admit kernel with order K squared vertices,  I mean, it also holds for bipartite C4 free graphs, obviously, because they are C3, C4 free.  So how do you get the kernel? Well, we know that J cannot contain more than 6K squared", "id": 125}
{"start": 2977.4, "end": 2997.96, "text": "  minus 2K vertices. And we know from another theorem from another paper that C3 free graphs  with K squared over log K vertices must have an independent set of size at least K.  And now we know that if H contains more than this many vertices, then we will get the yes", "id": 126}
{"start": 2997.96, "end": 3019.72, "text": "  instance as well. Right? So it becomes an immediate consequence of the previous theorem,  but the previous theorem is even more general than this corollary. So this corollary does not  really use the full power of this theorem. All right. That's it. I think I'm going to", "id": 127}
{"start": 3019.72, "end": 3039.16, "text": "  finish on time. If you have questions, I will take them now.  It was 55 minutes, right, for the talk. I did not go under the time.  It's fine. We usually allow plus minus 10 minutes. That's all right.", "id": 128}
{"start": 3042.4399999999996, "end": 3062.6, "text": "  So I have a question about token sliding. Yes.  So how crucial, what happens if one does not restrict the independent sets during the configuration  to be not of the same size? Is that very critical for the difficulty or the easiness of the problem?", "id": 129}
{"start": 3062.6, "end": 3083.4, "text": "  Well, you have to be careful how you define that because in token sliding, tokens cannot  leave the graph. That's correct. But the independent set sequence, all the independent sets have to  be the same size, right? Well, if not, some token disappeared at some point. And I'm not sure how", "id": 130}
{"start": 3083.4, "end": 3105.96, "text": "  it disappeared. Right? Because you start with something of size K and you're going to something  of size K, you cannot leave the graph unless you define it in some way. So you will remain  of size K throughout. But you can become slightly larger than K. But where does the new token come", "id": 131}
{"start": 3105.96, "end": 3134.04, "text": "  from? So there is a third rule that I did not tell you about, which is called token addition and  removal. Under that rule, we actually allow you to remove vertices and add vertices as long as you  remain an independent set of size at least K. Does that answer your question? Yeah. Yeah. Yeah.", "id": 132}
{"start": 3134.04, "end": 3157.4, "text": "  Yeah. But in fact, it was shown that it was shown that so addition and removal is equivalent to token  jumping. I see. It doesn't, it never makes sense to add more tokens to your graph if you don't need  them. You're only making your life harder, intuitively speaking.", "id": 133}
{"start": 3161.08, "end": 3184.04, "text": "  So the other question that I had is, I mean, I heard, I,  so is it possible to view this whole problem on an exponential size graph where every vertex  corresponds to an independent set in the original graph? And then you have edges between two vertices.", "id": 134}
{"start": 3184.92, "end": 3207.7999999999997, "text": "  If there is an edge between two vertices of the independent set, and now you are doing a reachability  question, is that a meaningful way to think about this? But that's exactly what we're doing.  The way you define your adjacency, I think, so you mean you define, you make two independent  sets adjacent if one can be reached from the other via a single slide or a single jump. Exactly.", "id": 135}
{"start": 3207.7999999999997, "end": 3234.6, "text": "  Yeah. One edge. Yeah. There is one pair, U and B, which is adjacent. But that's exactly what we're  doing. Okay. Yeah. Right. I mean, if you, because we're looking at algorithms here, we kind of forget  the structural picture behind it. But this algorithm is finding a path in this graph that you're  describing. Yeah. Yeah. That's it. And what we're saying is you can do it in FBT time or not, depending", "id": 136}
{"start": 3234.6, "end": 3261.24, "text": "  on the problem we're talking about. Hi, Amir. Hi. How are you? Yeah, I'm good. So I had a question.  So do problems remain equally hard if we bound the, if we have a restriction on the number of times,", "id": 137}
{"start": 3261.24, "end": 3284.4399999999996, "text": "  we can move the token to a particular vertex.  The number of times you can move a token to a particular vertex.  Like the number of times the tokens can be moved to a vertex.  Well, that's definitely going to change the complexity in, at least intuitively speaking,", "id": 138}
{"start": 3284.4399999999996, "end": 3310.04, "text": "  right? Because now you're saying maybe it will, if you're bounding that by a constant,  then you might be saying that I'm not allowing exponentially large sequences anymore. But in  terms of exactly how the complexity changes, I don't have answers. I think it's a very nice  question to pose. Even in terms of non-parameterized complexity, standard complexity, I think that", "id": 139}
{"start": 3310.04, "end": 3330.36, "text": "  that would be a very interesting question because, because it will definitely affect the behavior.  I'm not sure exactly how yet. I don't know of any results that ask this particular question.  Okay. So I had one more question in the W hardness result that you presented. So do you know", "id": 140}
{"start": 3330.36, "end": 3357.88, "text": "  what is the length of the, the length of the changes, actually the number of changes or flips  that you make in your independence set? This is just, yes. Yes.  We do. So here the number of changes is going to be very, it's, it's, it's basically going to be  the shortest possible sequence. So it's, it's, it's, it's, it's basically going to be, so if you", "id": 141}
{"start": 3357.88, "end": 3377.88, "text": "  think about the simple construction, this one, it's basically literally going to be, these guys  are going to move here. So each is going to cost me one slide. And then they're all going to, and  now this guy is going to move here. And now I will pay one slide for each one here.", "id": 142}
{"start": 3379.0, "end": 3407.4, "text": "  Now this is the simplified version of it. Once you go to the complete version of it,  you have some extra slides within the path, but you can also count those.  Okay. So, but does this mean that, so does this mean that at a particular vertex, we are  placing the token at most once? In this case, yes. Okay. In this case, yes. Okay. So this problem", "id": 143}
{"start": 3407.4, "end": 3432.44, "text": "  should be hard even if we bound the number of times tokens can be moved to a vertex, right?  Yes. Okay. Yes. So, so here in this case, yes. Absolutely. Okay. Thanks.  So Akanshya, I might, I have a remark about your question. So if a vertex, if a vertex cannot get", "id": 144}
{"start": 3432.44, "end": 3456.92, "text": "  a token twice, then it somehow seems to be selecting disjoint independent sets,  a sequence of them, and that may have some bearing on coloring, just a top level.  So actually for the W hardness case that Amir presented, it is exactly the case, right? So", "id": 145}
{"start": 3456.92, "end": 3479.48, "text": "  we are not allowed to move the token like twice on the same vertex.  Yeah. So I didn't get your point of moving. So getting this disjoint independent sets actually.  Because if you say, if you think of it from my, the way I thought about it, right,  that you are actually trying to find a path in a large graph where every vertex corresponds to", "id": 146}
{"start": 3479.48, "end": 3509.0, "text": "  an independent set and you move from one independent set to another. So, but we can only move from  one independent set to the other if the changes is like in case of token sliding, it's one probably.  Yeah. Exactly.  So it looks to me that you're asking for a collection of independent sets which are", "id": 147}
{"start": 3509.0, "end": 3531.96, "text": "  vertex disjoint. If the token, a sequence of independent sets which are vertex disjoint.  Yeah. So if I may, I think, I think a conscious question would be more relevant in a place where  we don't have a monotone sequence, meaning a sequence. So we need a version of the problem  or some cases of the problem where a vertex has to be visited multiple times", "id": 148}
{"start": 3533.56, "end": 3555.72, "text": "  to find solutions. And that is known to be the case for some versions or some statements of the  problem. And in fact, I can just also, this is also, this was the crucial difference between  piece-based completeness and NP completeness of sliding versus jumping in bipartite graphs.  So it was because we were able to show that no vertex will be visited more than once.", "id": 149}
{"start": 3558.04, "end": 3577.72, "text": "  And the other problem. So that's why it's definitely an interesting question to pose,  but you have to be careful in what context you pose it.  Great.  I don't know if that kind of settles, answers your question.  Yes, yes, it does.  All right.  Thanks.", "id": 150}
{"start": 3578.44, "end": 3588.52, "text": "  You're welcome.  Any more questions?", "id": 151}
{"start": 3609.48, "end": 3633.48, "text": "  I guess not.  Yeah, I don't think there are any more questions. I will just once again announce the parameterized  algorithm 301 workshop, which is going to happen in December in the link has been posted once again", "id": 152}
{"start": 3633.48, "end": 3658.84, "text": "  in the chat. Some advanced topics in parameterized complexity will be discussed. Those interested  can have a look and register for it. And yeah, if there are any more questions, please ask away.", "id": 153}
{"start": 3663.48, "end": 3687.16, "text": "  So anyone can register for the school?  Yes, yes, anyone can.  Yeah, it's free and it's online and yeah, it's open to everyone.", "id": 154}
{"start": 3688.12, "end": 3710.36, "text": "  Awesome. So I can share it with my students as well.  Of course, of course, please do. Yeah, that would be good.  And we assume some basic understanding of parameterized algorithms, but we have already  shared a link on the page where students can go and go through some previous lectures in  parameterized algorithms if they wish to just brace up or revise stuff.", "id": 155}
{"start": 3710.36, "end": 3732.1200000000003, "text": "  All right, so I guess, okay, I don't think there are any more questions. So maybe this is a good  time to wrap up. So thank you once again, Professor Amitro for agreeing to give the talk. It was", "id": 156}
{"start": 3732.1200000000003, "end": 3757.48, "text": "  really nice to have you and it was really good to have something different than what we usually hear  in every parent-based complexity talk, at least most of them. So and yeah, these are really  interesting problems to think upon. And thank you to the audience for being with us. And that's  it for today. We wrap up. See you all next week. Thank you. Bye. Thank you. Bye.", "id": 157}
